import UIKit

print("1. Описать несколько структур – любой легковой автомобиль и любой грузовик.")

print("2. Структуры должны содержать марку авто, год выпуска, объем багажника/кузова, запущен ли двигатель, открыты ли окна, заполненный объем багажника.")

print("3. Описать перечисление с возможными действиями с автомобилем: запустить/заглушить двигатель, открыть/закрыть окна, погрузить/выгрузить из кузова/багажника груз определенного объема.")

print("4. Добавить в структуры метод с одним аргументом типа перечисления, который будет менять свойства структуры в зависимости от действия.")

print("5. Инициализировать несколько экземпляров структур. Применить к ним различные действия.")

print("6. Вывести значения свойств экземпляров в консоль.")
